# FormArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormArray Class
Members See Also
---
An array that contains form objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FormArray : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class FormArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class FormArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FormArray
# See Also
FormArray Members
Autodesk.Revit.DB Namespace